<template>
  <div class="main-page">
    <Banner />
    <TitleItem caption="Проекты"/>
    <div class="container">
      <HousesList />
    </div>
    <TitleItem caption="О Компании"/>
    <ContentBlock>
      <p>Добро пожаловать на сайт нашей компании по строительству домов в Санкт-Петербурге и области! Мы - команда
         профессионалов, специализирующихся на создании уютных и функциональных жилых пространств, которые сочетают в
         себе высокое качество, современные технологии и индивидуальный подход.
      </p>
      <p>Наши услуги включают в себя полный цикл строительства, начиная от проектирования и заканчивая сдачей готового
         объекта. Мы предоставляем широкий спектр строительных услуг: от возведения каркасных и кирпичных домов до
         ремонта и реконструкции существующих строений. Независимо от размера и сложности проекта, мы гарантируем
         высокий уровень профессионализма и внимание к деталям.
      </p>
      <p>Наша цель - воплотить мечты клиентов в реальность, предоставляя надежные и стильные жилья. Мы сотрудничаем с
         опытными архитекторами, дизайнерами и строителями, чтобы обеспечить нашим заказчикам результат, который
         превосходит их ожидания.
      </p>
    </ContentBlock>

  </div>
</template>
<script setup>
</script>
<style lang="scss" scoped>
.main-page {
  display: flex;
  flex-direction: column;
  gap: 32px;
}
</style>